src/cs/computer_security/KBxCryptographyRet.org
#+TITLE: Cryptography
#+AUTHOR: Huxley Marvit
#+COURSE: 
#+SOURCE: 


#ret #hw

--------------

* Cryptography
  :PROPERTIES:
  :CUSTOM_ID: cryptography
  :END:
#+begin_example
  This is a bit of a weirder one..
#+end_example

Done prior:

#+begin_example
  -   Try turning on two-factor authentication, if you have that option.
  -   Think about how secure your password is, relative to how attackers would try guessing. Is it a dictionary or relatively common word? Is it all lower case letters, or do you also include uppercase letters, numbers, and/or symbols? Think about how large a search space is needed to find your password. Do some
  -   Generate a public/private key pair for yourself. Put the public key on our test laptop so that you can SSH into your account without typing a password. You could also use this key for your Github account, if you have one.
#+end_example

** Creating a custom hash function
   :PROPERTIES:
   :CUSTOM_ID: creating-a-custom-hash-function
   :END:
*** Requirements
    :PROPERTIES:
    :CUSTOM_ID: requirements
    :END:
What are the requirements for a hash function?

- [[https://stackoverflow.com/questions/2889473/when-is-it-safe-to-use-a-broken-hash-function][Source]]

  - No preimage: given \(y\), it should not be feasible to find \(x\)
    such that \(h(x) = y\).
  - No second preimage: given \(x_1\), it should not be feasible to find
    \(x_2\) (distinct from \(x_1\)) such that \(h(x_1) = h(x_2)\).
  - No collision: it should not be feasible to find any \(x_1\) and
    \(x_2\) (distinct from each other) such that \(h(x_1) = h(x_2)\).

#+begin_example
  What if we just.. use a neural network?
#+end_example

*** NN hash
    :PROPERTIES:
    :CUSTOM_ID: nn-hash
    :END:
Intuitively, using a neural network as a hash function seems like it
won't work. In fact, I believe it doesn't work, *I just don't know why
it doesn't work.* *** Of course, a vanilla neural network won't work
because we can just train a model to reverse its mapping. To solve this
problem, we can use something I call permute layers.

**** Permute Layers
     :PROPERTIES:
     :CUSTOM_ID: permute-layers
     :END:
*Concept --* Fundamentally, the concept of permute layers is to take an
input, and do some operation on it such that a non-continuous output
space is generated. The goal would be that: - Similar inputs lead to
vastly different outputs - Make there no guarantee that an adversarial
NN's guess of \(x\) is closer to \(x+\epsilon_1\) than it is to
\(x+ \frac{1}{\epsilon_2}\) - As in, we can't train a NN to reverse it!

*Implementation --* One possible implementation of these permute layers
would be simply permuting the bits that make up our tensors.

