docs/cs/computer_security/KBxCryptographyRet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-14 Thu 19:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cryptography</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Huxley Marvit" />
<link rel="stylesheet" href="/global.css" type="text/css"/>
<link rel="stylesheet" href="/admonition.css" type="text/css"/>

</head>
<body>
<div id="preamble" class="status">
<div class="header"><span class="site"><a href="https://taproot3.sanity.gq">TR3.5</a></span></div><div class="datarow"><h1 class="title">Cryptography</h1> <h2 class="subtitle"></h2> <span class="author">Huxley Marvit</span> <span class="date">2021-10-14 Thu 19:38</date></div>
</div>
<div id="content">
<div id="linktables"><div id="table-of-backlinks"><h2>Backlinks</h2><ul><li><a class='backlink' href='index.html'>CS240 Master Index</a></li> <li><a class='backlink' href='KBxCryptography.html'>Cryptography</a></li> </ul></div><div id="table-of-contents"><h2>Table of Contents</h2><div id="text-table-of-contents">
<ul>
<li><a href="#cryptography">1. Cryptography</a>
<ul>
<li><a href="#creating-a-custom-hash-function">1.1. Creating a custom hash function</a>
<ul>
<li><a href="#requirements">1.1.1. Requirements</a></li>
<li><a href="#nn-hash">1.1.2. NN hash</a></li>
<li><a href="#proof-of-concept">1.1.3. Proof of concept</a></li>
<li><a href="#results">1.1.4. Results</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div></div>
</div>
<p>
#ret #hw
</p>

<hr />

<div id="outline-container-cryptography" class="outline-2">
<h2 id="cryptography"><span class="section-number-2">1</span> Cryptography</h2>
<div class="outline-text-2" id="text-cryptography">
<pre class="example" id="org98a049b">
This is a bit of a weirder one..
</pre>

<p>
Done prior:
</p>

<pre class="example" id="org2f02c57">
-   Try turning on two-factor authentication, if you have that option.
-   Think about how secure your password is, relative to how attackers would try guessing. Is it a dictionary or relatively common word? Is it all lower case letters, or do you also include uppercase letters, numbers, and/or symbols? Think about how large a search space is needed to find your password. Do some
-   Generate a public/private key pair for yourself. Put the public key on our test laptop so that you can SSH into your account without typing a password. You could also use this key for your Github account, if you have one.
</pre>
</div>

<div id="outline-container-creating-a-custom-hash-function" class="outline-3">
<h3 id="creating-a-custom-hash-function"><span class="section-number-3">1.1</span> Creating a custom hash function</h3>
<div class="outline-text-3" id="text-creating-a-custom-hash-function">
</div>
<div id="outline-container-requirements" class="outline-4">
<h4 id="requirements"><span class="section-number-4">1.1.1</span> Requirements</h4>
<div class="outline-text-4" id="text-requirements">
<p>
What are the requirements for a hash function?
</p>

<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/2889473/when-is-it-safe-to-use-a-broken-hash-function">Source</a>

<ul class="org-ul">
<li>No preimage: given \(y\), it should not be feasible to find \(x\)
such that \(h(x) = y\).</li>
<li>No second preimage: given \(x_1\), it should not be feasible to find
\(x_2\) (distinct from \(x_1\)) such that \(h(x_1) = h(x_2)\).</li>
<li>No collision: it should not be feasible to find any \(x_1\) and
\(x_2\) (distinct from each other) such that \(h(x_1) = h(x_2)\).</li>
</ul></li>
</ul>

<pre class="example" id="org89a2059">
What if we just.. use a neural network?
</pre>
</div>
</div>

<div id="outline-container-nn-hash" class="outline-4">
<h4 id="nn-hash"><span class="section-number-4">1.1.2</span> NN hash</h4>
<div class="outline-text-4" id="text-nn-hash">
<p>
Intuitively, using a neural network as a hash function seems like it
won't work. In fact, I believe it doesn't work, <b>I just don't know why
it doesn't work.</b> <b>*</b> Of course, a vanilla neural network won't work
because we can just train a model to reverse its mapping. To solve this
problem, we can use something I call permute layers.
</p>
</div>

<ol class="org-ol">
<li><a id="permute-layers"></a>Permute Layers<br />
<div class="outline-text-5" id="text-permute-layers">
<p>
<b>Concept --</b> Fundamentally, the concept of permute layers is to take an
input, and do some operation on it such that a non-continuous output
space is generated. The goal would be that: - Similar inputs lead to
vastly different outputs - Make there no guarantee that an adversarial
NN's guess of \(x\) is closer to \(x+\epsilon_1\) than it is to
\(x+ \frac{1}{\epsilon_2}\) - As in, we can't train a NN to reverse it!
</p>

<p>
<b>Implementation --</b> One possible implementation of these permute layers
would be simply permuting the bits that make up our tensors.
</p>
</div>
</li>
</ol>
</div>
