docs/cs/computer_security/KBxCryptographyRet.tex
% Created 2021-10-14 Thu 19:38
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parindent}{0pt}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{svg}
\usepackage{tikz}
\usepackage{cancel}
\usepackage{pgfplots}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\usepackage{csquotes}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\renewcommand{\tableofcontents}{}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Huxley Marvit}
\date{\today}
\title{Cryptography}
\hypersetup{
 pdfauthor={Huxley Marvit},
 pdftitle={Cryptography},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\#ret \#hw

\noindent\rule{\textwidth}{0.5pt}

\section{Cryptography}
\label{sec:orgf8e7ef2}
\begin{verbatim}
This is a bit of a weirder one..
\end{verbatim}

Done prior:

\begin{verbatim}
-   Try turning on two-factor authentication, if you have that option.
-   Think about how secure your password is, relative to how attackers would try guessing. Is it a dictionary or relatively common word? Is it all lower case letters, or do you also include uppercase letters, numbers, and/or symbols? Think about how large a search space is needed to find your password. Do some
-   Generate a public/private key pair for yourself. Put the public key on our test laptop so that you can SSH into your account without typing a password. You could also use this key for your Github account, if you have one.
\end{verbatim}

\subsection{Creating a custom hash function}
\label{sec:org87e7553}
\subsubsection{Requirements}
\label{sec:org7b7a394}
What are the requirements for a hash function?

\begin{itemize}
\item \href{https://stackoverflow.com/questions/2889473/when-is-it-safe-to-use-a-broken-hash-function}{Source}

\begin{itemize}
\item No preimage: given \(y\), it should not be feasible to find \(x\)
such that \(h(x) = y\).
\item No second preimage: given \(x_1\), it should not be feasible to find
\(x_2\) (distinct from \(x_1\)) such that \(h(x_1) = h(x_2)\).
\item No collision: it should not be feasible to find any \(x_1\) and
\(x_2\) (distinct from each other) such that \(h(x_1) = h(x_2)\).
\end{itemize}
\end{itemize}

\begin{verbatim}
What if we just.. use a neural network?
\end{verbatim}

\subsubsection{NN hash}
\label{sec:org8288675}
Intuitively, using a neural network as a hash function seems like it
won't work. In fact, I believe it doesn't work, \textbf{I just don't know why
it doesn't work.} \textbf{*} Of course, a vanilla neural network won't work
because we can just train a model to reverse its mapping. To solve this
problem, we can use something I call permute layers.

\begin{enumerate}
\item Permute Layers
\label{sec:orgb0fc552}
\textbf{Concept --} Fundamentally, the concept of permute layers is to take an
input, and do some operation on it such that a non-continuous output
space is generated. The goal would be that: - Similar inputs lead to
vastly different outputs - Make there no guarantee that an adversarial
NN's guess of \(x\) is closer to \(x+\epsilon_1\) than it is to
\(x+ \frac{1}{\epsilon_2}\) - As in, we can't train a NN to reverse it!

\textbf{Implementation --} One possible implementation of these permute layers
would be simply permuting the bits that make up our tensors.
\end{enumerate}
