docs/cs/computer_security/KBxCryptographyRet.html

<div id="outline-container-proof-of-concept" class="outline-4">
<h4 id="proof-of-concept"><span class="section-number-4">1.1.3</span> Proof of concept</h4>
<div class="outline-text-4" id="text-proof-of-concept">
<p>
The code below is meant as proof of concept &#x2013; or rather, demonstration
of concept. It is messy, unoptimized, and surely error ridden, but it
seems to work.
</p>

<p>
<b>Outline:</b> - Create a deep neural network with randomly initialized
weights. - Ensure that it is deterministic with a set seed. This seed
could potentially be carried with the hash. - Add permute layers
throughout the model. - Store the first 8 bits to preserve the mantissa,
then concatenate and permute the rest. - Reform floats from the permuted
bits, and convert back into a tensor. - Do some post-processing to clean
the output - Convert each float in the output tensor to bits, then take
the last half of each as this is the part that is most shuffled -
Convert to base 10, then to 16 - Profit
</p>

<p>
The code can also be found
<a href="https://gist.github.com/TheEnquirer/1260b18f40cec198348a0a30d0a19e83">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-comment-delimiter">#####################</span>
<span class="org-comment-delimiter">#       </span><span class="org-comment">SETUP       #</span>
<span class="org-comment-delimiter">#####################</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">imports</span>
<span class="org-keyword">import</span> torch
<span class="org-keyword">import</span> torch.nn <span class="org-keyword">as</span> nn
<span class="org-keyword">import</span> torch.nn.functional <span class="org-keyword">as</span> F
<span class="org-keyword">import</span> math
<span class="org-keyword">import</span> struct
<span class="org-keyword">from</span> codecs <span class="org-keyword">import</span> decode
<span class="org-keyword">import</span> numpy <span class="org-keyword">as</span> np
<span class="org-keyword">import</span> string

<span class="org-variable-name">INP</span> = [0.1, 0.0, 1.01] <span class="org-comment-delimiter"># </span><span class="org-comment">our input!</span>
<span class="org-variable-name">SAFE</span> = 8 <span class="org-comment-delimiter"># </span><span class="org-comment">don't permute the first 8 bits, so we don't get infs and 0</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">makes things deterministic</span>
np.random.seed(0)
torch.manual_seed(0)

torch.set_default_dtype(torch.float64) <span class="org-comment-delimiter"># </span><span class="org-comment">make sure we use the right datatype!</span>


<span class="org-comment-delimiter">#######################</span>
<span class="org-comment-delimiter">#       </span><span class="org-comment">BASE NN       #</span>
<span class="org-comment-delimiter">#######################</span>

<span class="org-keyword">class</span> <span class="org-type">Net</span>(nn.Module): <span class="org-comment-delimiter"># </span><span class="org-comment">define the model</span>

    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>):
        <span class="org-builtin">super</span>(Net, <span class="org-keyword">self</span>).__init__()
        <span class="org-keyword">self</span>.<span class="org-variable-name">l1</span> = nn.Linear(3, 128) <span class="org-comment-delimiter"># </span><span class="org-comment">linear layer, with input size 3</span>
        <span class="org-keyword">self</span>.<span class="org-variable-name">pl1</span> = PermuteLayer(128,256) <span class="org-comment-delimiter"># </span><span class="org-comment">custom permute layer</span>

        <span class="org-keyword">self</span>.<span class="org-variable-name">l2</span> = nn.Linear(256, 512)
        <span class="org-keyword">self</span>.<span class="org-variable-name">pl2</span> = PermuteLayer(512, 512)

        <span class="org-keyword">self</span>.<span class="org-variable-name">l3</span> = nn.Linear(512, 256)
        <span class="org-keyword">self</span>.<span class="org-variable-name">pl3</span> = PermuteLayer(256, 256)

        <span class="org-keyword">self</span>.<span class="org-variable-name">l4</span> = nn.Linear(256, 128)
        <span class="org-keyword">self</span>.<span class="org-variable-name">pl4</span> = PermuteLayer(128, 8) <span class="org-comment-delimiter"># </span><span class="org-comment">output a tensor with 8 floats</span>


    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x): <span class="org-comment-delimiter"># </span><span class="org-comment">run it through!</span>
        <span class="org-variable-name">x</span> = [100*(y+1) <span class="org-keyword">for</span> y <span class="org-keyword">in</span> x] <span class="org-comment-delimiter"># </span><span class="org-comment">add 1 and multiply by 100 for each input element</span>
        <span class="org-variable-name">x</span> = torch.tensor(x) <span class="org-comment-delimiter"># </span><span class="org-comment">then convert it to a tensor</span>

        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.l1(x) <span class="org-comment-delimiter"># </span><span class="org-comment">run it through the layers</span>
        <span class="org-variable-name">x</span> = x.view(-1, 128)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.pl1(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.l2(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.pl2(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.l3(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.pl3(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.l4(x)
        <span class="org-variable-name">x</span> = <span class="org-keyword">self</span>.pl4(x)

        <span class="org-keyword">return</span> x


<span class="org-comment-delimiter">####################################</span>
<span class="org-comment-delimiter">#       </span><span class="org-comment">CUSTOM PERMUTE LAYER       #</span>
<span class="org-comment-delimiter">####################################</span>

<span class="org-keyword">class</span> <span class="org-type">PermuteLayer</span>(nn.Module): <span class="org-comment-delimiter"># </span><span class="org-comment">not my code! default linear code comes from https://auro-227.medium.com/writing-a-custom-layer-in-pytorch-14ab6ac94b77</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">after modification, acts as a normal linear layer except it permutes the bits.</span>
    <span class="org-keyword">def</span> <span class="org-function-name">__init__</span>(<span class="org-keyword">self</span>, size_in, size_out):
        <span class="org-builtin">super</span>().__init__()
        <span class="org-keyword">self</span>.<span class="org-variable-name">size_in</span>, <span class="org-keyword">self</span>.<span class="org-variable-name">size_out</span> = size_in, size_out
        <span class="org-variable-name">weights</span> = torch.Tensor(size_out, size_in)
        <span class="org-keyword">self</span>.<span class="org-variable-name">weights</span> = nn.Parameter(weights)  <span class="org-comment-delimiter"># </span><span class="org-comment">nn.Parameter is a Tensor that's a module parameter.</span>
        <span class="org-variable-name">bias</span> = torch.Tensor(size_out)
        <span class="org-keyword">self</span>.<span class="org-variable-name">bias</span> = nn.Parameter(bias)

        <span class="org-comment-delimiter"># </span><span class="org-comment">initialize weights and biases</span>
        nn.init.kaiming_uniform_(<span class="org-keyword">self</span>.weights, a=math.sqrt(5)) <span class="org-comment-delimiter"># </span><span class="org-comment">weight init</span>
        fan_in, _ = nn.init._calculate_fan_in_and_fan_out(<span class="org-keyword">self</span>.weights)
        bound = 1 / math.sqrt(fan_in)
        nn.init.uniform_(<span class="org-keyword">self</span>.bias, -bound, bound)  <span class="org-comment-delimiter"># </span><span class="org-comment">bias init</span>

    <span class="org-keyword">def</span> <span class="org-function-name">forward</span>(<span class="org-keyword">self</span>, x): <span class="org-comment-delimiter"># </span><span class="org-comment">where the permuting happens</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">this part isn't pretty..</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">but according to Dr. Brian Dean, we don't need to constant factor optimize!</span>

        bits = <span class="org-string">""</span> <span class="org-comment-delimiter"># </span><span class="org-comment">store bits in a char array</span>
        saved = [] <span class="org-comment-delimiter"># </span><span class="org-comment">save the bits we want to protect</span>

        <span class="org-keyword">for</span> i,v <span class="org-keyword">in</span> <span class="org-builtin">enumerate</span>(x[0]): <span class="org-comment-delimiter"># </span><span class="org-comment">loop through the floats</span>
            tnsr = float_to_bin(v) <span class="org-comment-delimiter"># </span><span class="org-comment">convert them to binary</span>
            saved.append(tnsr[:SAFE]) <span class="org-comment-delimiter"># </span><span class="org-comment">save what we need to</span>
            bits += tnsr[SAFE:] <span class="org-comment-delimiter"># </span><span class="org-comment">and add to the char array</span>

        p = np.random.permutation([x <span class="org-keyword">for</span> x <span class="org-keyword">in</span> bits]) <span class="org-comment-delimiter"># </span><span class="org-comment">permute it!</span>
        p = <span class="org-string">''</span>.join(<span class="org-builtin">map</span>(<span class="org-builtin">str</span>, p)) <span class="org-comment-delimiter"># </span><span class="org-comment">and then.. join it back together</span>

        converted = []

        <span class="org-comment-delimiter"># </span><span class="org-comment">loop through p, chunk it into segments</span>
        <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(<span class="org-builtin">len</span>(p)//(64-SAFE)):
            <span class="org-comment-delimiter"># </span><span class="org-comment">convert segment to floats</span>
            item = bin_to_float(saved[i]+p[(64-SAFE)*i:((64-SAFE)*i)+(64-SAFE)])
            converted.append(item)

        converted = torch.tensor([converted]) <span class="org-comment-delimiter"># </span><span class="org-comment">change it back to a tensor</span>
        x = converted

        w_times_x= torch.mm(x, <span class="org-keyword">self</span>.weights.t()) <span class="org-comment-delimiter"># </span><span class="org-comment">matrix multiply them</span>
        <span class="org-keyword">return</span> torch.add(w_times_x, <span class="org-keyword">self</span>.bias)  <span class="org-comment-delimiter"># </span><span class="org-comment">w times x + b</span>


<span class="org-comment-delimiter">#########################</span>
<span class="org-comment-delimiter">#       </span><span class="org-comment">HELPERS         #</span>
<span class="org-comment-delimiter">#########################</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">not my code! from https://stackoverflow.com/questions/16444726/binary-representation-of-float-in-python-bits-not-hex</span>
<span class="org-keyword">def</span> <span class="org-function-name">bin_to_float</span>(b):
    <span class="org-doc">""" Convert binary string to a float. """</span>
    bf = int_to_bytes(<span class="org-builtin">int</span>(b, 2), 8)  <span class="org-comment-delimiter"># </span><span class="org-comment">8 bytes needed for IEEE 754 binary64.</span>
    <span class="org-keyword">return</span> struct.unpack(<span class="org-string">'&gt;d'</span>, bf)[0]

<span class="org-keyword">def</span> <span class="org-function-name">int_to_bytes</span>(n, length):  <span class="org-comment-delimiter"># </span><span class="org-comment">Helper function</span>
    <span class="org-doc">""" Int/long to byte string.</span>
<span class="org-doc">        Python 3.2+ has a built-in int.to_bytes() method that could be used</span>
<span class="org-doc">        instead, but the following works in earlier versions including 2.x.</span>
<span class="org-doc">    """</span>
    <span class="org-keyword">return</span> decode(<span class="org-string">'%%0%dx'</span> % (length &lt;&lt; 1) % n, <span class="org-string">'hex'</span>)[-length:]

<span class="org-keyword">def</span> <span class="org-function-name">float_to_bin</span>(value):  <span class="org-comment-delimiter"># </span><span class="org-comment">For testing.</span>
    <span class="org-doc">""" Convert float to 64-bit binary string. """</span>
    [<span class="org-variable-name">d</span>] = struct.unpack(<span class="org-string">"&gt;Q"</span>, struct.pack(<span class="org-string">"&gt;d"</span>, value))
    <span class="org-keyword">return</span> <span class="org-string">'{:064b}'</span>.<span class="org-builtin">format</span>(d)


<span class="org-keyword">def</span> <span class="org-function-name">int2base</span>(x, base): <span class="org-comment-delimiter"># </span><span class="org-comment">not my code! modified from https://stackoverflow.com/questions/2267362/how-to-convert-an-integer-to-a-string-in-any-base</span>
    <span class="org-keyword">if</span> x &lt; 0:    sign = -1
    <span class="org-keyword">elif</span> x == 0: <span class="org-keyword">return</span> digs[0]
    <span class="org-keyword">else</span>:        sign = 1
    x *= sign
    digits = []
    <span class="org-keyword">while</span> x:
        digits.append(digs[x % base])
        x = x // base
    <span class="org-keyword">if</span> sign &lt; 0: digits.append(<span class="org-string">'-'</span>)
    digits.reverse()
    <span class="org-keyword">return</span> <span class="org-string">''</span>.join(digits)
digs = string.digits + string.ascii_letters

<span class="org-comment-delimiter">########################</span>
<span class="org-comment-delimiter">#       </span><span class="org-comment">OUTPUT         #</span>
<span class="org-comment-delimiter">########################</span>

model = Net()

result = <span class="org-builtin">list</span>(model(INP).detach().numpy()[0]) <span class="org-comment-delimiter"># </span><span class="org-comment">convert output to list</span>

output_bits = <span class="org-string">''</span>
<span class="org-keyword">for</span> i <span class="org-keyword">in</span> result:
    <span class="org-comment-delimiter"># </span><span class="org-comment">convert to bits, then take the second half</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">because it's more shuffled</span>
    output_bits += float_to_bin(i)[32:]

<span class="org-keyword">print</span>(int2base(<span class="org-builtin">int</span>(output_bits, 2), 16)) <span class="org-comment-delimiter"># </span><span class="org-comment">clean the output up and print it out</span>
</pre>
</div>
</div>
</div>
