docs/cs/computer_security/KBxCryptographyRet.html

<div id="outline-container-results" class="outline-4">
<h4 id="results"><span class="section-number-4">1.1.4</span> Results</h4>
<div class="outline-text-4" id="text-results">
<p>
Running the hash function with a few example inputs gives us:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Input</th>
<th scope="col" class="org-left">Output</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">1.0, 0.0, 0.0</td>
<td class="org-left">7707b1d82074095cd7ec672e372dd54002594a60762ddab49954fd7536983af3</td>
</tr>

<tr>
<td class="org-left">1.0, 0.1, 0.0</td>
<td class="org-left">489014b1b6a164c4410abb09d38fa2c974dda663853a870d8da2e7bbe1276561</td>
</tr>

<tr>
<td class="org-left">1.0, 0.01, 0.0</td>
<td class="org-left">ba1c5e18233cfd68ef14fa7d77cf47fbaeca8182bcc6688fdfce32b0feab6e69</td>
</tr>

<tr>
<td class="org-left">1.0, 0.01, 1000.0</td>
<td class="org-left">593c5d758312de157e7bff4733227ddb95033a364724e8e7492a355ca32b56e0</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Raw Output</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">6898.310410004538, -27752.31448079027, 5368.972044730368, 15157.626683930517, 2565.062517919854, 3530.8778547601196, -1500.8912099151323, 12012.064166096481</td>
</tr>

<tr>
<td class="org-left">10800.338151941398, 7383.0027867194185, 3447.3852618554415, 27197.54416266343, -16078.800441461795, 15308.535315814917, -10308.394947398328, 21108.498117302897</td>
</tr>

<tr>
<td class="org-left">6385.139558575604, -11019.165137885793, -2616.5486990505, -4771.384640650819, -27374.854418398354, -22029.83964691363, 32460.107410001277, 39128.374837604184</td>
</tr>

<tr>
<td class="org-left">28033.42732152106, 27429.429875103833, 19619.10146999292, -20498.237496016412, 28754.94659500775, 20997.47309229607, 11754.59598281484, 13.915845011749695</td>
</tr>
</tbody>
</table>

<p>
Cosine Similarity of these outputs were calculated with:
</p>

<pre class="example" id="org1e2c8ff">
similarity = np.dot(a, b) / (np.linalg.norm(a) * np.linalg.norm(b)
</pre>

<p>
The sorted Cosine Similarities of the outputs above are as follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">A</th>
<th scope="col" class="org-right">B</th>
<th scope="col" class="org-right">Similarity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">4</td>
<td class="org-right">-0.29788</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">-0.24353</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">-0.09071</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.157713</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.240493</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">0.372453</td>
</tr>
</tbody>
</table>

<p>
This table demonstrates how different inputs lead to drastically
different outputs, regardless of how similar the inputs were.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">%%</th>
<th scope="col" class="org-right">A</th>
<th scope="col" class="org-right">B</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-right">0.000996</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">4</td>
<td class="org-right">0.000999</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">0.001000</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">0.995037</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">0.995982</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0.999950</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1.0</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1.000000</td>
</tr>
</tbody>
</table>

<p>
%% Further analysis is required, as collision rate and etc. have not yet
been determined because no large scale tests have been done. However,
this method of hash function seems potentially viable.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
