docs/cs/computer_security/KBxCryptographyRet.tex

\subsubsection{Results}
\label{sec:org5604434}
Running the hash function with a few example inputs gives us:

\begin{center}
\begin{tabular}{ll}
Input & Output\\
\hline
1.0, 0.0, 0.0 & 7707b1d82074095cd7ec672e372dd54002594a60762ddab49954fd7536983af3\\
1.0, 0.1, 0.0 & 489014b1b6a164c4410abb09d38fa2c974dda663853a870d8da2e7bbe1276561\\
1.0, 0.01, 0.0 & ba1c5e18233cfd68ef14fa7d77cf47fbaeca8182bcc6688fdfce32b0feab6e69\\
1.0, 0.01, 1000.0 & 593c5d758312de157e7bff4733227ddb95033a364724e8e7492a355ca32b56e0\\
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{l}
Raw Output\\
\hline
6898.310410004538, -27752.31448079027, 5368.972044730368, 15157.626683930517, 2565.062517919854, 3530.8778547601196, -1500.8912099151323, 12012.064166096481\\
10800.338151941398, 7383.0027867194185, 3447.3852618554415, 27197.54416266343, -16078.800441461795, 15308.535315814917, -10308.394947398328, 21108.498117302897\\
6385.139558575604, -11019.165137885793, -2616.5486990505, -4771.384640650819, -27374.854418398354, -22029.83964691363, 32460.107410001277, 39128.374837604184\\
28033.42732152106, 27429.429875103833, 19619.10146999292, -20498.237496016412, 28754.94659500775, 20997.47309229607, 11754.59598281484, 13.915845011749695\\
\end{tabular}
\end{center}

Cosine Similarity of these outputs were calculated with:

\begin{verbatim}
similarity = np.dot(a, b) / (np.linalg.norm(a) * np.linalg.norm(b)
\end{verbatim}

The sorted Cosine Similarities of the outputs above are as follows:

\begin{center}
\begin{tabular}{rrr}
A & B & Similarity\\
\hline
1 & 4 & -0.29788\\
3 & 4 & -0.24353\\
2 & 4 & -0.09071\\
2 & 3 & 0.157713\\
1 & 3 & 0.240493\\
1 & 2 & 0.372453\\
\end{tabular}
\end{center}

This table demonstrates how different inputs lead to drastically
different outputs, regardless of how similar the inputs were.

\begin{center}
\begin{tabular}{rrr}
\%\% & A & B\\
\hline
2 & 4 & 0.000996\\
1 & 4 & 0.000999\\
3 & 4 & 0.001000\\
1 & 2 & 0.995037\\
2 & 3 & 0.995982\\
1 & 3 & 0.999950\\
1 & 1 & 1.0\\
2 & 2 & 1.000000\\
\end{tabular}
\end{center}

\%\% Further analysis is required, as collision rate and etc. have not yet
been determined because no large scale tests have been done. However,
this method of hash function seems potentially viable.
\end{document}
